//********************************************************************************
//
// Subscribe
//
// Autor	: Okamoto
// Date		: 2017/06/24
// Fix		: 2017/06/25
//
//********************************************************************************
using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using UniRx;
using UniRx.Triggers;

public class Subscribe : MonoBehaviour {

	//********************************************************************************
	//MACRO
	//********************************************************************************
	//********************************************************************************
	//CLASS BEFORE
	//********************************************************************************
	//STRUCTURE
	//********************************************************************************
	//CLASS AFTER
	//********************************************************************************
	//PUBLIC
	public GameObject p_Cube;
	//********************************************************************************
	//PRIVATE
	//********************************************************************************

	//******************************
	//Start
	//起動後初回に実行される
	//******************************
	void Start ()
	{
		//初期位置
		Observable.Return(new Vector3(0.0f, 0.0f, 0.0f))
			.Subscribe(pos => p_Cube.transform.localPosition = pos);    //実行した瞬間に移動される
		
		//ずっと動く ※update()でずっとやってるようなイメージ
		this.UpdateAsObservable()
			.Subscribe(_ => MoveCube());   //using UniRx.Triggersが必要	
	}

	//******************************
	//MoveCube
	//キューブ移動
	//******************************
	void MoveCube()
	{
		p_Cube.transform.localPosition += new Vector3(0.5f, 0.0f, 0.0f) * Time.deltaTime;
	}
}
