//********************************************************************************
//
// Timer
//
// Autor	: Okamoto
// Date		: 2017/06/25
// Fix		: 2017/06/25
//
//********************************************************************************

using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using UniRx;
using System;

public class Timer : MonoBehaviour {

	//********************************************************************************
	//MACRO
	//********************************************************************************
	//CLASS BEFORE
	//********************************************************************************
	//STRUCTURE
	//********************************************************************************
	//CLASS AFTER
	//********************************************************************************
	//PUBLIC
	//********************************************************************************
	//PRIVATE
	//********************************************************************************

	//******************************
	//Start
	//起動後初回に実行される
	//******************************
	void Start ()
	{
		//初期座標
		Observable.Return(this.gameObject.transform.localPosition)
			.Subscribe(pos => this.gameObject.transform.localPosition = pos);

		//５秒後
		Observable.Timer(TimeSpan.FromSeconds(5))
			.Subscribe(_ => this.gameObject.transform.localScale = new Vector3(5.0f, 5.0f, 5.0f))	//スケール小さくする
			.AddTo(this);	//missing回避
	}
}
