//********************************************************************************
//
// Where
//
// Autor	: Okamoto
// Date		: 2017/06/24
// Fix		: 2017/06/25
//
//********************************************************************************

using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using UniRx;
using UniRx.Triggers;

public class Where : Cube {

	//********************************************************************************
	//MACRO
	readonly Vector3 START_POS = new Vector3(0.0f, 10.0f, 0.0f);
	//********************************************************************************
	//CLASS BEFORE
	//********************************************************************************
	//STRUCTURE
	//********************************************************************************
	//CLASS AFTER
	//********************************************************************************
	//PUBLIC
	//********************************************************************************
	//PRIVATE
	//********************************************************************************

	//******************************
	//Start
	//起動後初回に実行される
	//******************************
	void Start ()
	{
		//初期位置
		Observable.Return(START_POS)
			.Subscribe(pos => this.gameObject.transform.localPosition = pos);

		//プッシュ(実行)する
		this.UpdateAsObservable()
			.Where(_=> Input.GetMouseButton(0))	//左クリックしてる間
			.Subscribe(l => Move(1.0f, 0.0f));
		//プッシュ(実行)する
		this.UpdateAsObservable()
			.Where(_ => Input.GetMouseButton(1))	//右クリックしてる間
			.Subscribe(l => Move(-1.0f, 0.0f));
	}
}
